alefragnani.project-manager
bierner.color-info
brunnerh.file-properties-viewer
charliermarsh.ruff
continue.continue
eamodio.gitlens
evgeniypeshkov.syntax-highlighter
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
grrrck.positron-plus-1-e
gruntfuggly.todo-tree
gvelasq.tomorrow-night-bright-r-classic
johnpapa.vscode-peacock
mechatroner.rainbow-csv
mhutchie.git-graph
mikestead.dotenv
ms-pyright.pyright
ms-python.debugpy
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.live-server
posit.air-vscode
posit.publisher
posit.shiny
pucelle.vscode-css-navigation
quarto.quarto
redhat.vscode-yaml
stkb.rewrap
streetsidesoftware.code-spell-checker
